
Процедура СформироватьДанныеИОтправить() Экспорт
	
	ДанныеСерверов = ФормированиеПоказателейСерверов.ИницилизироватьДанныеСерверов();
	ФормированиеПоказателейСерверов.ДобавитьДанныеДляОтправки(ДанныеСерверов);
	ОтправитьДанныеВСистемуМониторинга(ДанныеСерверов);
	
КонецПроцедуры

// Описание
// 
// Параметры:
// 	ДанныеСерверов - Описание
Процедура ОтправитьДанныеВСистемуМониторинга(ДанныеСерверов)
	
	Для Каждого Данные Из ДанныеСерверов Цикл

		КомандаZabbix = "C:/zabbix_agent/bin/win64/zabbix_sender.exe -c C:/zabbix_agent/conf/zabbix_agentd.win.conf -s """
			+ Данные.ИмяСервера + """ -i" + Данные.ПутьКФайлуДанных;
		ЗапуститьПриложение(КомандаZabbix);

	КонецЦикла;
	
КонецПроцедуры






